modm-ext/data.modm.io/docs/svd/header_stm32h7b0xx.svd
        <register>
          <name>PRAR_PRG2</name>
          <description>Flash Protection Address to Program Register for bank2</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PROT_AREA_START</name>
              <description>PCROP area start status bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>PROT_AREA_END</name>
              <description>PCROP area end status bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMEP</name>
              <description>PCROP protected erase enable option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAR_CUR2</name>
          <description>Flash Current Secure Address Register for bank2</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEC_AREA_START</name>
              <description>Secure-only area start status bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>SEC_AREA_END</name>
              <description>Secure-only area end status bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMES</name>
              <description>Secure access protected erase enable option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAR_PRG2</name>
          <description>Flash Secure Address Register for bank2</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEC_AREA_START</name>
              <description>Secure-only area start status bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>SEC_AREA_END</name>
              <description>Secure-only area end status bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMES</name>
              <description>Secure access protected erase enable option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSN_CUR2</name>
          <description>Flash Current Write Protection Register on bank2</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRPSN</name>
              <description>Sector write protection option status byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSN_PRG2</name>
          <description>Flash Write Protection to Program Register on bank2</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRPSN</name>
              <description>Sector write protection option status byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCR2</name>
          <description>Flash CRC Control register For Bank2 Register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRC_SECT</name>
              <description>CRC sector number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CRC_BY_SECT</name>
              <description>CRC sector mode select bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD_SECT</name>
              <description>CRC sector select bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_SECT</name>
              <description>CRC sector list clear bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_CRC</name>
              <description>CRC start bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_CRC</name>
              <description>CRC clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BURST</name>
              <description>CRC burst size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ALL_BANK</name>
              <description>CRC select bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSADD2</name>
          <description>Flash CRC Start Address Register for Bank2</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRC_START_ADDR</name>
              <description>CRC start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCEADD2</name>
          <description>Flash CRC End Address Register for Bank2</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRC_END_ADDR</name>
              <description>CRC end address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDATA2</name>
          <description>Flash CRC Data Register for Bank2</description>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRC_DATA</name>
              <description>CRC result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_FA2</name>
          <description>Flash ECC Fail Address For Bank2 Register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAIL_ECC_ADDR</name>
              <description>ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>OTP_FAIL_ECC</name>
              <description>OTP ECC error bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
